cases/fullNet/fullNet/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.75 -0.75 -0.75)
	(0.75 -0.75 -0.75)
	(0.75 2.0 -0.75)
	(-0.75 2.0 -0.75)
	(-0.75 -0.75 0.75)
	(0.75 -0.75 0.75)
	(0.75 2.0 0.75)
	(-0.75 2.0 0.75)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (40 80 40) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	inlet
	{
		type	patch;
		faces	(
			(1 5 4 0)
		);
	}
	outlet
	{
		type	patch;
		faces	(
			(3 7 6 2)
		);
	}
	boundaries
	{
		type	patch;
		faces	(
			(0 3 2 1)
			(4 5 6 7)
			(0 4 7 3)
			(2 6 5 1)
		);
	}
);
